tranings = {
    'ОНбордінг':{
        'головний': 'Сидоренко А. Б.',
        'посада': ['Вчитель пайтону група 1-2'],
        'дата': '10.07.2024'

    },
    'Веб-дезайнер':{
        'головний': 'Зінюк Н. П.',
        'посада': ['Вчит малювати в клмпютері'],
        'дата': '20.05.2024'
    },

    'Веб-розробник':{
        'головний':'Марілючюк О. Б.',
        'посада': ['Розробляе гри'],
        'дата': '5.06.2024'
    },

    'Адміністратор':{
        'головний':'Глазюк Н. Д.',
        'посада': ['Відповідае за документи'],
        'дата': '8.03.2024'
    }
}

print('Тренінги Python🤗')
print('1-назви тренінгів, 2-дані транінгів')
action = input('Номер події (disebled-вимкнути):') 
while action != 'disebled':
    if action == '1':
        for traning in tranings:
            print('-', traning)
    if action == '2':
        title = input('Назва курсу:')
        if title in tranings:
            print(tranings[title]['головний'])
            print(tranings[title]['посада'])
            print(tranings[title]['дата'])
        else:
            print('Такого тренінгу не має!!!!!😶‍🌫️')
    action = input('Номер події ()')

   
